public class distancefromorigin{

  /* 원점으로부터의 거리
   * 2차 평면 위에 N개의 점이 주어졌을 때,
   * 원점에서 가까운 점부터 순서대로 번호를 출력하는 프로그램을 작성
   * 거리가 같은 점이 여러 개인 경우, 번호가 작은 점 부터 출력
   * 
   * 거리 = 멘하턴 거리
   * 멘하턴 거리란?
   * 두 점 (x1,y1), (x2,y2) 사이의 멘하턴 거리는
   * |x1 - x2| + |y1 - y2|로 정의됩니다.
   * 
   * 
   * 입력 : 
   * 2
   * 1 5
   * -3 2
   * 
   * 출력 : 
   * 2
   * 1
   * 
   * 입력 : 
   * 4
   * 1 8
   * 3 4
   * 5 5
   * -7 0
   * 
   * 출력 : 
   * 2
   * 4
   * 1
   * 3
   * 
   */
  public static void main(String[] args){

  }
}