/*
 * dxdytechnique / 이동 경로상에 있는 모든 숫자 더하기
 * 
 * N * N 크기의 정사각형 모양의 격자 정보가 주어졌을 때, 가운데 위치에서 북쪽을 향한 상태로
 * 움직이는 것을 시작하려 합니다. T개으 ㅣ명령에 따라 움직이며, 명령어는 L, R, F로 주어집니다.
 * 명령 L은 왼쪽으로 90도 방향 전환을, 명령 R은 오른쪽으로 90도 방향 전환을,
 * 명령 F가 주어지면 바라보고 있는 방향으로 한칸 이동하게 됩니다. 시작 위치를 포함하여
 * 위치를 이동하게 될 때마다 해당 칸에 적혀있는 수를 계속 더한다고 했을 때, 이들의 총합을
 * 구하는 프로그램을 작성해보세요. 단, 격자의 범위를 벗어나게 디는 명령어는 무시해야함에 유의합니다.
 * 
 * 입력 :
 * 3 8
 * RFFFLFLF
 * 1 2 3
 * 4 5 6
 * 7 8 9
 * 
 * 출력 : 
 * 16
 */
public class dxdytechniquesumofmove{
  public static void main(String[] args){

  }
}